# -*- coding: utf-8 -*-
#!/usr/bin/python3

#
#         ┌─┐       ┌─┐
#      ┌──┘ ┴───────┘ ┴──┐
#      │                 │
#      │       ───       │
#      │  ─┬┘       └┬─  │
#      │                 │
#      │       ─┴─       │
#      │                 │
#      └───┐         ┌───┘
#          │         │
#          │         │
#          │         │
#          │         └──────────────┐
#          │                        │
#          │                        ├─┐
#          │                        ┌─┘
#          │                        │
#          └─┐  ┐  ┌───────┬──┐  ┌──┘
#            │ ─┤ ─┤       │ ─┤ ─┤
#            └──┴──┘       └──┴──┘
#                神兽保佑
#                代码无BUG!
#
#                  ___====-_  _-====___
#            _--^^^#####//      \\#####^^^--_
#         _-^##########// (    ) \\##########^-_
#        -############//  |\^^/|  \\############-
#      _/############//   (@::@)   \\############\_
#     /#############((     \\//     ))#############\
#    -###############\\    (oo)    //###############-
#   -#################\\  / VV \  //#################-
#  -###################\\/      \//###################-
# _#/|##########/\######(   /\   )######/\##########|\#_
# |/ |#/\#/\#/\/  \#/\##\  |  |  /##/\#/  \/\#/\#/\#| \|
# `  |/  V  V  `   V  \#\| |  | |/#/  V   '  V  V  \|  '
#    `   `  `      `   / | |  | | \   '      '  '   '
#                     (  | |  | |  )
#                    __\ | |  | | /__
#                   (vvv(VVV)(VVV)vvv)
#                  神兽保佑
#                代码无BUG!
#                                                    __----~~~~~~~~~~~------___
#                                   .  .   ~~//====......          __--~ ~~
#                   -.            \_|//     |||\\  ~~~~~~::::... /~
#                ___-==_       _-~o~  \/    |||  \\            _/~~-
#        __---~~~.==~||\=_    -_--~/_-~|-   |\\   \\        _/~
#    _-~~     .=~    |  \\-_    '-~7  /-   /  ||    \      /
#  .~       .~       |   \\ -_    /  /-   /   ||      \   /
# /  ____  /         |     \\ ~-_/  /|- _/   .||       \ /
# |~~    ~~|--~~~~--_ \     ~==-/   | \~--===~~        .\
#          '         ~-|      /|    |-~\~~       __--~~
#                      |-~~-_/ |    |   ~\_   _-~            /\
#                           /  \     \__   \/~                \__
#                       _--~ _/ | .-~~____--~-/                  ~~==.
#                      ((->/~   '.|||' -_|    ~~-/ ,              . _||
#                                 -_     ~\      ~~---l__i__i__i--~~_/
#                                 _-~-__   ~)  \--______________--~~
#                               //.-~~~-~_--~- |-------~~~~~~~~
#                                      //.-~~~--\
#                  神兽保佑
#                代码无BUG!
#      ,----------------,              ,---------,
#         ,-----------------------,          ,"        ,"|
#       ,"                      ,"|        ,"        ,"  |
#      +-----------------------+  |      ,"        ,"    |
#      |  .-----------------.  |  |     +---------+      |
#      |  |                 |  |  |     | -==----'|      |
#      |  |  I LOVE DOS!    |  |  |     |         |      |
#      |  |  Bad command or |  |  |/----|`---=    |      |
#      |  |  C:\>_          |  |  |   ,/|==== ooo |      ;
#      |  |                 |  |  |  // |(((( [33]|    ,"
#      |  `-----------------'  |," .;'| |((((     |  ,"
#      +-----------------------+  ;;  | |         |,"
#         /_)______________(_/  //'   | +---------+
#    ___________________________/___  `,
#   /  oooooooooooooooo  .o.  oooo /,   \,"-----------
#  / ==ooooooooooooooo==.o.  ooo= //   ,`\--{)B     ,"
# /_==__==========__==_ooo__ooo=_/'   /___________,"
#
#                 .-~~~~~~~~~-._       _.-~~~~~~~~~-.
#             __.'              ~.   .~              `.__
#           .'//                  \./                  \\`.
#         .'//                     |                     \\`.
#       .'// .-~"""""""~~~~-._     |     _,-~~~~"""""""~-. \\`.
#     .'//.-"                 `-.  |  .-'                 "-.\\`.
#   .'//______.============-..   \ | /   ..-============.______\\`.
# .'______________________________\|/______________________________`.

import sys
from copy import deepcopy
import tongji
import chuangkou
import os

from PyQt5.QtCore import *
from PyQt5.QtWidgets import *
from PyQt5.QtGui import *


def file_name(file_dir):
    L = []
    for root, dirs, files in os.walk(file_dir):
        for file in files:
            if os.path.splitext(file)[1] == '.c':
                L.append(os.path.join(root, file))
            if os.path.splitext(file)[1] == '.cpp':
                L.append(os.path.join(root, file))
    return L

s, x, c, w, l, a = 0, 0, 0, 0, 0, 0
for i in sys.argv[1:]:
    path = ''
    if(i[0] == '-'):
        if(i[1] == 's'):
            s = 1
        if(i[1] == 'x'):
            x = 1
        if(i[1] == 'c'):
            c = 1
        if(i[1] == 'w'):
            w = 1
        if(i[1] == 'l'):
            l = 1
        if(i[1] == 'a'):
            a = 1
    if(i[0] == '*' and s == 1):
        path = deepcopy(os.getcwd())
    if(i[0] != '*' and i[0] != '-'):
        path = deepcopy(i)
print("-----------这是一个简单的统计小公举-----------")
if(x == 1):
    app = QApplication(sys.argv)
    myapp = chuangkou.Form()  # MyForm是自己的窗体类名
    myapp.show()
    sys.exit(app.exec_())
if(s == 1):
    print(path)
    files = file_name(path)
    for i in files:
        print(i)
        count = tongji.Count(i)
        ans = ''
        if(a == 1):
            print("代码行数："+str(count.codeLines))
            print("空   行："+str(count.emptyLines))
            print("注释行数："+str(count.commentLines))
        if(c == 1):
            print("字符数："+str(count.charCount))
        if(w == 1):
            print("词 数："+str(count.wordCount))
        if(l == 1):
            print("行 数："+str(count.lineCount))
        print("----------------------------------------------")
elif(s == 0):
    count = tongji.Count(path)
    print(path)
    ans = ''
    if(a == 1):
        print("代码行数："+str(count.codeLines))
        print("空   行："+str(count.emptyLines))
        print("注释行数："+str(count.commentLines))
    if(c == 1):
        print("字符数："+str(count.charCount))
    if(w == 1):
        print("词 数："+str(count.wordCount))
    if(l == 1):
        print("行 数："+str(count.lineCount))
    print("----------------------------------------------")
